-- ----------------------------------------------
-- 판매점 데이터 생성
-- ----------------------------------------------
insert into SHOP_TABLE values(0, "드림테크", "010-2222-2222", "test@test.com");
insert into SHOP_TABLE values(0, "ㅇㅇ회사", "010-2222-3333", "test@t22t.com");


-- ----------------------------------------------
-- 유저 생성
-- ----------------------------------------------
insert into USER_TABLE values("admin", "관리자", "1234", 1, "2020-02-22", 0);
insert into USER_TABLE values("user", "일반사용자", "1234", 2, "2020-02-22", 1);


-- ----------------------------------------------
-- 상품 정보 생성
-- ----------------------------------------------
insert into ITEM_TABLE values(0, "딸기 잼", 1);
insert into ITEM_TABLE values(0, "포도 잼", 1);
insert into ITEM_TABLE values(0, "사과 잼", 1);


-- ----------------------------------------------
-- 드림테크 회사에서의 딸기잼 판매 데이터 생성
-- ----------------------------------------------
insert into SALE_TABLE values(0, "2020-01-01", 1, 1, 20);
insert into SALE_TABLE values(0, "2020-01-02", 1, 1, 19);